# MaterialParamTransparency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialParamTransparency Property
ParameterTypeId Class See Also
---
"Transparency"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialParamTransparency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialParamTransparency As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialParamTransparency {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace